Обработки/Reports/_НастройкиКлиентскихОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_НастройкиКлиентскихОтчетов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаОтчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отчеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.НастройкиОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_НастройкиКлиентскихОтчетов/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область Внешний_интерфейс

&НаКлиенте
Процедура ПриСменеТекущейОрганизации() Экспорт
	
	// Обновляем организацию, очищаем отбор по счетам ДУ, заполняем таблицу отчетов.
	Отчет.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	Договоры.Очистить();
	
	ОтборПриИзменении(Неопределено);
	
КонецПроцедуры

#КонецОбласти

#Область Обработчики_событий_формы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОтборПриИзменении(Неопределено);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);	
	
	Если ЗначениеЗаполнено(Параметры.Организация) Тогда
		Отчет.Организация					= Параметры.Организация;
		ЭтаФорма.УчитываяСрокФормирования	= Параметры.УчитываяСрокФормирования;
		Отчет.Дата							= Параметры.Дата;
		Отчет.ГруппаОтчетов					= Параметры.ГруппаОтчетов;
		ЭтаФорма.Клиенты					= Параметры.Клиенты;
		ЭтаФорма.ВидыДоговоров				= Параметры.ВидыДоговоров;
		ЭтаФорма.Договоры					= Параметры.Договоры;
		ЭтаФорма.СписокОтчетов				= Параметры.СписокОтчетов;
		ЭтаФорма.Периодичность				= Параметры.Периодичность;
	Иначе
		Отчет.Организация	= ПараметрыСеанса.ТекущаяОрганизация;
		Отчет.Дата			= ТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	Если ЗначениеЗаполнено(Отчет.ГруппаОтчетов) Тогда
		Настройки.Удалить("Отчет.Дата");
		Настройки.Удалить("Отчет.ГруппаОтчетов");
		Настройки.Удалить("Клиенты");
		Настройки.Удалить("ВидыДоговоров");
		Настройки.Удалить("Договоры");
		Настройки.Удалить("СписокОтчетов");
		Настройки.Удалить("Периодичность");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)

	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);

КонецПроцедуры

#КонецОбласти

#Область Обработчики_событий_элементов_формы

&НаКлиенте
Процедура ОтборПриИзменении(Элемент)
	
	Если ЭтаФорма.Клиенты.Количество() > 0
		ИЛИ ЭтаФорма.ВидыДоговоров.Количество() > 0
		ИЛИ ЭтаФорма.Договоры.Количество() > 0
		ИЛИ ЭтаФорма.СписокОтчетов.Количество() > 0
		ИЛИ ЗначениеЗаполнено(ЭтаФорма.Периодичность) Тогда
		ЭтаФорма.ЗаголовокОтборов = "установлен";
	Иначе
		ЭтаФорма.ЗаголовокОтборов = "не задан";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Команды_формы

&НаКлиенте
Процедура ВыполнитьФормирование(Команда)
	
	ВыполнитьФормированиеНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область Служебные_процедуры_и_функции

&НаСервере
Функция ПолучитьСтруктуруСДаннымиОтбораНаСервере()
	
	ЭлементыОтбора = Новый Массив;
	
	ЭлементыОтбора.Добавить("Клиенты");
	ЭлементыОтбора.Добавить("ВидыДоговоров");
	ЭлементыОтбора.Добавить("Договоры");
	ЭлементыОтбора.Добавить("СписокОтчетов");
	ЭлементыОтбора.Добавить("Периодичность");
		
	Отбор = Новый Структура;
	
	Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
		
		Если ЗначениеЗаполнено(ЭтаФорма[ЭлементОтбора]) Тогда
			Отбор.Вставить(ЭлементОтбора, ЭтаФорма[ЭлементОтбора]);
		КонецЕсли; 		
		
	КонецЦикла;
	
	Возврат Отбор;
	
КонецФункции

&НаСервере
Процедура ВыполнитьФормированиеНаСервере()
	
	Результат.Очистить();
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	
	Результат.Вывести(ОтчетОбъект.Сформировать(УчитываяСрокФормирования, ПолучитьСтруктуруСДаннымиОтбораНаСервере()));
		
КонецПроцедуры

&НаКлиенте
Процедура КлиентыПриИзменении(Элемент)
	
	ОтборПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыДоговоровДоверительногоУправленияПриИзменении(Элемент)
	
	ОтборПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьПриИзменении(Элемент)
	
	ОтборПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОтчетовПриИзменении(Элемент)
	
	ОтборПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетаДоверительногоУправленияПриИзменении(Элемент)
	
	ОтборПриИзменении(Элемент);
	
КонецПроцедуры

#КонецОбласти
